#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ЭкипировкаПриИзменении(Элемент)
	Элементы.ТипПредмета.Видимость = Объект.Экипировка;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)	
	ЗначенияПоУмолчанию = Новый Структура;
	Если Объект.Экипировка тогда
		ЗначенияПоУмолчанию.Вставить("Сила", 0);
		ЗначенияПоУмолчанию.Вставить("Ловкость", 0);
	    ЗначенияПоУмолчанию.Вставить("Выносливость", 0);
	    ЗначенияПоУмолчанию.Вставить("Интелект", 0);
	    ЗначенияПоУмолчанию.Вставить("ЗащитаВЕдиницах", 0);
	    ЗначенияПоУмолчанию.Вставить("ЗащитаВПроцентах", 0);
	    ЗначенияПоУмолчанию.Вставить("ШансУворота", 0);
	    ЗначенияПоУмолчанию.Вставить("МаксСтамина", 0);
	    ЗначенияПоУмолчанию.Вставить("МаксМана", 0);
	    ЗначенияПоУмолчанию.Вставить("ФизическийУрон", 0);
	    ЗначенияПоУмолчанию.Вставить("МагическийУрон", 0);
	    ЗначенияПоУмолчанию.Вставить("ПробивнойУрон", 0);
		ЗначенияПоУмолчанию.Вставить("МаксЗдоровье", 0);
		ЗначенияПоУмолчанию.Вставить("Здоровье", 0);
		ЗначенияПоУмолчанию.Вставить("Мана", 0);
	    ЗначенияПоУмолчанию.Вставить("Стамина", 0);
	КонецЕсли;
	
	предмет = Справочники.Предметы.НайтиПоНаименованию(Объект.Наименование);
	
	НаборЗаписей = РегистрыСведений.ХарактеристикиЭкипировки.СоздатьНаборЗаписей();
	Для каждого элемента из ЗначенияПоУмолчанию Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ПредметЭкипировки = предмет.Ссылка;
		НоваяЗапись.Характеристика = ПланыВидовХарактеристик.ВидыХарактеристикПредметов.НайтиПоНаименованию(элемента.Ключ);               
		НоваяЗапись.Значение = элемента.Значение;
	КонецЦикла; 
	НаборЗаписей.Записать(Ложь);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ТипПредмета.Видимость = Объект.Экипировка;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
