#Область ОписаниеПеременных
	Перем СоответствиеХарактеристики;
#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Игрок") тогда
		РеквизитТекущийИгрок = Параметры.Игрок;
		ПолучитьХарактеристики();
		Элементы.Персонаж.Заголовок = "Персонаж: " + Строка(РеквизитТекущийИгрок.Наименование);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОткрытьИнвентарь(Команда)
	Отбор = Новый Структура("Игрок", РеквизитТекущийИгрок);	
	
	//Отбор.Вставить("Предмет", "НеСодержит ""НетЭкипировки""");
	ОткрытьФорму("ОбщаяФорма.Инвентарь", Новый Структура("Отбор", Отбор));
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьХарактеристики(Команда)
	Парам = Новый Структура("Характеристики", РеквизитХарактеристикиИгрока);
	ОткрытьФорму("ОбщаяФорма.Характеристики",Парам);
КонецПроцедуры

&НаКлиенте
Процедура Экипировка(Команда)
	Отбор = Новый Структура("Игрок", РеквизитТекущийИгрок);
	Оповещение = Новый ОписаниеОповещения("ПолучитьХарактеристики", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.ЭкипировкаПерсонажей.Форма.ФормаСписка", Новый Структура("Отбор",Отбор),,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПолучитьХарактеристики(Чтото1 = Неопределено, Чтото2 = Неопределено) экспорт
	ЭлементыГруппы = Элементы.ГруппаХарактеристики.ПодчиненныеЭлементы;
	Если ЭлементыГруппы.Количество() > 0 тогда
		Для ИндексЭлемента = 1 по ЭлементыГруппы.Количество() Цикл
			Элементы.Удалить(ЭлементыГруппы.Получить(0));
		КонецЦикла;	
	КонецЕсли;
	// Создаем запрос для получения характеристик игрока
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   ЗначениеХарактеристикИгроков.Характеристика КАК Характеристика,
        |   ЗначениеХарактеристикИгроков.Значение КАК Значение
        |ИЗ
        |   РегистрСведений.ЗначениеХарактеристикИгроков КАК ЗначениеХарактеристикИгроков
        |ГДЕ
        |   ЗначениеХарактеристикИгроков.Игрок = &Игрок";
    Запрос.УстановитьПараметр("Игрок", РеквизитТекущийИгрок);
    
    // Выполняем запрос и получаем результат
    Результат = Запрос.Выполнить().Выбрать();
    
    // Очищаем существующую таблицу значений
    РеквизитХарактеристикиИгрока.Очистить();
    
    // Заполняем таблицу значений данными из результата запроса
	Если Результат.Количество() > 0 тогда		
	    Пока Результат.Следующий() Цикл
	        НоваяСтрока = РеквизитХарактеристикиИгрока.Добавить();
	        НоваяСтрока.Характеристика = Результат.Характеристика;
	        НоваяСтрока.Значение = Результат.Значение;
	    КонецЦикла;
	КонецЕсли;
	
	Для Каждого Строка Из РеквизитХарактеристикиИгрока Цикл
        // Создаем надпись для названия характеристики
        НоваяНадпись = Элементы.Добавить(Строка.Характеристика + "_Надпись", Тип("ДекорацияФормы"), Элементы.ГруппаХарактеристики);
        НоваяНадпись.Вид = ВидДекорацииФормы.Надпись;
        НоваяНадпись.Заголовок = Строка.Характеристика  + ": " + Строка.Значение;
    КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ПоискВраговНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПоискВрагов(Команда)
	
КонецПроцедуры  

&НаСервере
Процедура ПоискПредметовНаСервере()
	ГенераторСлучайныхЧисел = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПредметов(Команда)
	ПоискПредметовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭкспедицияНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура Экспедиция(Команда)
	Парам = Новый Структура;
	Парам.Вставить("Игрок",РеквизитТекущийИгрок);
	Оповещение = Новый ОписаниеОповещения("ПолучитьХарактеристики", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.События",Парам,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Крафт(Команда)
	Парам = Новый Структура;
	Парам.Вставить("Игрок",РеквизитТекущийИгрок);
	ОткрытьФорму("Документ.СозданиеПредмета.Форма.ФормаСоздания",Парам);
КонецПроцедуры


#КонецОбласти




