#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Игрок") тогда
		РеквизитТекущийИгрок = Параметры.Игрок;
	    ОбновитьИнвентарь();
	    ОбновитьРецептыСоздания();	
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура СоздатьПродукт(Команда)
	СоздатьПредмет(Элементы.РеквизитРецептыСоздания.ТекущиеДанные.Предмет);
КонецПроцедуры


&НаКлиенте
Процедура Реквизит1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)		
	СоздатьПредмет(Элемент.ТекущиеДанные.Предмет);                            
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьПредмет(Предмет)
	РецептСоздания = Справочники.РецептыСоздания.НайтиПоРеквизиту("Продукт",Предмет);
	Материалы = РецептСоздания.Материалы;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РегистрПредметовОстатки.Предмет КАК Предмет,
	               |	РегистрПредметовОстатки.КоличествоОстаток КАК Количество
	               |ИЗ
	               |	РегистрНакопления.РегистрПредметов.Остатки(, Игрок = &Игрок) КАК РегистрПредметовОстатки";
	Запрос.Параметры.Вставить("Игрок",РеквизитТекущийИгрок);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Материал Из Материалы Цикл
		Если РезультатЗапроса.НайтиСтроки(Новый Структура("Предмет",Материал.Материал)).Количество() > 0 тогда
			Если Материал.Количество <= РезультатЗапроса.НайтиСтроки(Новый Структура("Предмет",Материал.Материал))[0].Количество тогда
				Продолжить;
			Иначе	
				Сообщить("Вам не хватает материалов!");
				Возврат;
			КонецЕсли;
		Иначе	
			Сообщить("Вам не хватает материалов!");
			Возврат;	
		КонецЕсли;
	КонецЦикла;
	
	Операция = Документы.Заглушка.СоздатьДокумент();
	Операция.Дата = ТекущаяДата();
	Операция.Игрок = РеквизитТекущийИгрок;
	Операция.Записать(РежимЗаписиДокумента.Запись); 
	
	НовыйНаборЗаписей = Операция.Движения.РегистрПредметов; // РегистрыНакопления.РегистрПредметов.СоздатьНаборЗаписей(); 
	НоваяЗаписьПродукт = НовыйНаборЗаписей.Добавить(); 
	НоваяЗаписьПродукт.Период = Операция.Дата;
	НоваяЗаписьПродукт.ВидДвижения = ВидДвиженияНакопления.Приход;
	НоваяЗаписьПродукт.Игрок = РеквизитТекущийИгрок;
	НоваяЗаписьПродукт.Предмет = РецептСоздания.Продукт;
	НоваяЗаписьПродукт.количество = РецептСоздания.КоличествоРезультата;
	
	Для Каждого Материал Из Материалы Цикл
		НоваяЗапись = НовыйНаборЗаписей.Добавить(); 
		НоваяЗапись.Период = Операция.Дата;
		НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
		НоваяЗапись.Игрок = РеквизитТекущийИгрок;
		НоваяЗапись.Предмет = Материал.Материал;
		НоваяЗапись.Количество = Материал.Количество;
	КонецЦикла;
	НовыйНаборЗаписей.Записать();
	ОбновитьИнвентарь();
	Сообщить("Предмет успешно создан!");
КонецПроцедуры

&НаСервере
Процедура СоздатьПродуктНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрПредметовОстатки.Предмет КАК Предмет,
		|	РегистрПредметовОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.РегистрПредметов.Остатки(, Игрок = &Игрок) КАК РегистрПредметовОстатки";	
	Запрос.УстановитьПараметр("Игрок", РеквизитТекущийИгрок);	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();	
	ВыбранныйЭлемент = Элементы.Реквизит1.ТекущийЭлемент;
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнвентарь()
	РеквизитИнвентаря.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрПредметовОстатки.Предмет КАК Предмет,
		|	РегистрПредметовОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.РегистрПредметов.Остатки(, Игрок = &Игрок) КАК РегистрПредметовОстатки";
	Запрос.УстановитьПараметр("Игрок", РеквизитТекущийИгрок);
	РеквизитИнвентаря.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура ОбновитьРецептыСоздания()
	РеквизитРецептыСоздания.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РецептыСоздания.Продукт КАК Продукт,
		|	РецептыСоздания.Материалы.(
		|		Материал КАК Материал,
		|		Количество КАК КоличествоМатериалов
		|	) КАК Материалы,
		|	РецептыСоздания.КоличествоРезультата КАК Количество
		|ИЗ
		|	Справочник.РецептыСоздания КАК РецептыСоздания";
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		НоваяЗаписьРецептыСоздания = РеквизитРецептыСоздания.Добавить();
		НоваяЗаписьРецептыСоздания.Предмет = РезультатЗапроса.Продукт;
		НоваяЗаписьРецептыСоздания.Количество = РезультатЗапроса.Количество;
		Материалы = РезультатЗапроса.Материалы.Выбрать();
		СтрокаМатериалов = "";
		Пока Материалы.Следующий() Цикл
			НоваяЗаписьМатериалы = НоваяЗаписьРецептыСоздания.Материалы.Добавить();
			НоваяЗаписьМатериалы.Материал = Материалы.Материал;
			НоваяЗаписьМатериалы.Количество = Материалы.КоличествоМатериалов;	
			СтрокаМатериалов = СтрокаМатериалов + Строка(Материалы.Материал.Наименование) + ": " + Строка(Материалы.КоличествоМатериалов) + Символы.ПС;	
		КонецЦикла;
		НоваяЗаписьРецептыСоздания.МатериалыСтрокой = СтрокаМатериалов;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти