
&НаКлиенте
Процедура ПредметНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	Сообщить("aaAS");	
КонецПроцедуры

&НаКлиенте
Процедура ПредметНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("РежимВыбора",Истина);
	Отбор = Новый Структура("ТипПредмета", Запись.Экипировка);
	Отбор.Вставить("Игрок", Запись.Игрок);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	Оповещение = Новый ОписаниеОповещения("ВыбранныйПредмет", ЭтаФорма);
	ОткрытьФорму("РегистрНакоплений.РегистрПредметов.ФормаИтогов",ПараметрыФормы,ЭтаФорма,,,,Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныйПредмет(Предмет, ВторойПараметр) Экспорт
	Если ПроверкаТипаПредмета(Предмет,Запись.Экипировка) тогда
		Запись.Предмет = Предмет;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭкипировкаПриИзменении(Элемент)
	Элементы.Предмет.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПредметПриИзменении(Элемент)
	
КонецПроцедуры

&НаСервере
Функция ПроверкаТипаПредмета(Предмет,ОжидаемыйТип)
	Если Справочники.Предметы.НайтиПоНаименованию(Предмет).ТипПредмета = ОжидаемыйТип тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПредметОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ПроверкаТипаПредмета(ВыбранноеЗначение,Запись.Экипировка) тогда
		Запись.Предмет = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("МенюЭкипировки") тогда
		ЭтаФорма.Заголовок = Параметры.МенюЭкипировки;
	КонецЕсли;
	Элементы.Предмет.Видимость = ?(Запись.Экипировка.Пустая(), Ложь, Истина);
КонецПроцедуры  

// выбирать предмет Из Инвентаря а не из справочника предметов
