
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Отбор") тогда
		Если Параметры.Отбор.Свойство("Игрок") тогда
			РеквизитТекущийИгрок = Параметры.Отбор.Игрок;
			ЭлементОтбора = Параметры.Отбор;
			Элементы.Игрок.Видимость = Ложь;
			ПараметрыФормы = Параметры.Отбор;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СписокВыборНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Парам = Новый Структура;
	Парам.Вставить("Игрок", РеквизитТекущийИгрок);
	Парам.Вставить("Экипировка", Элементы.Экипировка.Родитель.ТекущиеДанные.Экипировка);
	РеквизитТипПредмета = Элементы.Экипировка.Родитель.ТекущиеДанные.Экипировка;
	РеквизитПредмет = Элементы.Предмет.Родитель.ТекущиеДанные.Предмет;
	Оповещение = Новый ОписаниеОповещения("СписокОбработкаВыбораНаСервере", ЭтотОбъект);
	ОткрытьФорму("РегистрНакопления.РегистрПредметов.Форма.ФормаВыбора", Парам, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	СписокВыборНаСервере();
КонецПроцедуры

&НаСервере
Процедура СписокВыборЗначенияНаСервере()
	Сообщить("1");
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СписокВыборЗначенияНаСервере();
КонецПроцедуры

&НаСервере
Процедура СписокОбработкаВыбораНаСервере(Предмет, чтото) экспорт
	Если ТипЗнч(Предмет) = Тип("СправочникСсылка.Предметы") и Предмет <> Неопределено тогда
		МенеджерЗаписи = РегистрыСведений.ЭкипировкаПерсонажей.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Игрок = РеквизитТекущийИгрок;
		МенеджерЗаписи.Экипировка = РеквизитТипПредмета;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() тогда
			МенеджерЗаписи.Предмет = Предмет;
			МенеджерЗаписи.Записать();
		КонецЕсли; 
		Элементы.Список.Обновить();
	Иначе
		МенеджерЗаписи = РегистрыСведений.ЭкипировкаПерсонажей.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Игрок = РеквизитТекущийИгрок;
		МенеджерЗаписи.Экипировка = РеквизитТипПредмета;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() тогда
			МенеджерЗаписи.Предмет = Неопределено;
			МенеджерЗаписи.Записать();
		КонецЕсли;                                 
		Элементы.Список.Обновить();
		Сообщить("Вы не выбрали привет!");
	КонецЕсли;
	ОбработатьИзмененияЭкипировки(Предмет);
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СписокОбработкаВыбораНаСервере(Элемент, Истина);
КонецПроцедуры

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьХарактеристикиПредмета(Предмет)
	Если Предмет = Неопределено тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначениеХарактеристикИгроков.Характеристика КАК Характеристика,
		|	ЗначениеХарактеристикИгроков.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ЗначениеХарактеристикИгроков КАК ЗначениеХарактеристикИгроков
		|ГДЕ
		|	ЗначениеХарактеристикИгроков.Игрок = &Игрок";
	Запрос.УстановитьПараметр("Игрок", РеквизитТекущийИгрок);          
	ХарактеристикиИгрока = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикиЭкипировки.Характеристика КАК Характеристика,
		|	ХарактеристикиЭкипировки.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ХарактеристикиЭкипировки КАК ХарактеристикиЭкипировки
		|ГДЕ
		|	ХарактеристикиЭкипировки.ПредметЭкипировки = &Предмет";
	Запрос.УстановитьПараметр("Предмет", Предмет);      
	ХарактеристикиПредмета = Запрос.Выполнить().Выгрузить(); 
	
	НаборЗаписей = РегистрыСведений.ЗначениеХарактеристикИгроков.СоздатьНаборЗаписей();
	
	Для каждого ХарактеристикаИгрока из ХарактеристикиИгрока Цикл                                                              
		Попытка
			ВидХарактеристики = ПланыВидовХарактеристик.ВидыХарактеристикПредметов.НайтиПоНаименованию(ХарактеристикаИгрока.Характеристика.Наименование);
		Исключение
			продолжить;
		КонецПопытки;
		Попытка
			ХарактеристикаПредмета = ХарактеристикиПредмета.НайтиСтроки(Новый Структура("Характеристика", ВидХарактеристики))[0];	
		Исключение
			ХарактеристикаПредмета = Новый Структура("Значение", 0);
		КонецПопытки;
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Игрок = РеквизитТекущийИгрок;
		НоваяЗапись.Характеристика = ХарактеристикаИгрока.Характеристика;
		НоваяЗапись.Значение = ХарактеристикаИгрока.Значение + ХарактеристикаПредмета.Значение; 
	КонецЦикла;
	НаборЗаписей.Записать();
КонецПроцедуры

&НаСервере
Процедура ВычестьХарактеристикиПредмета(Предмет)
	Если Предмет = Неопределено тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначениеХарактеристикИгроков.Характеристика КАК Характеристика,
		|	ЗначениеХарактеристикИгроков.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ЗначениеХарактеристикИгроков КАК ЗначениеХарактеристикИгроков
		|ГДЕ
		|	ЗначениеХарактеристикИгроков.Игрок = &Игрок";
	Запрос.УстановитьПараметр("Игрок", РеквизитТекущийИгрок);          
	ХарактеристикиИгрока = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикиЭкипировки.Характеристика КАК Характеристика,
		|	ХарактеристикиЭкипировки.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ХарактеристикиЭкипировки КАК ХарактеристикиЭкипировки
		|ГДЕ
		|	ХарактеристикиЭкипировки.ПредметЭкипировки = &Предмет";
	Запрос.УстановитьПараметр("Предмет", Предмет);      
	ХарактеристикиПредмета = Запрос.Выполнить().Выгрузить(); 
	
	НаборЗаписей = РегистрыСведений.ЗначениеХарактеристикИгроков.СоздатьНаборЗаписей();
	
	Для каждого ХарактеристикаИгрока из ХарактеристикиИгрока Цикл                                                              
		Попытка
			ВидХарактеристики = ПланыВидовХарактеристик.ВидыХарактеристикПредметов.НайтиПоНаименованию(ХарактеристикаИгрока.Характеристика.Наименование);
		Исключение
			продолжить;
		КонецПопытки;
		Попытка
			ХарактеристикаПредмета = ХарактеристикиПредмета.НайтиСтроки(Новый Структура("Характеристика", ВидХарактеристики))[0];	
		Исключение
			ХарактеристикаПредмета = Новый Структура("Значение", 0);
		КонецПопытки;
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Игрок = РеквизитТекущийИгрок;
		НоваяЗапись.Характеристика = ХарактеристикаИгрока.Характеристика;
		НоваяЗапись.Значение = ХарактеристикаИгрока.Значение - ХарактеристикаПредмета.Значение; 
	КонецЦикла;
	НаборЗаписей.Записать();
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзмененияЭкипировки(НовыйПредмет)
	// если остался тот же предмет или его не было и новый не выбрали
	Если НовыйПредмет.Наименование = РеквизитПредмет.Наименование тогда
		Возврат;
	//	если экипировки не было но ей выбрали	
	ИначеЕсли ПустаяСтрока(РеквизитПредмет.Наименование) и не ПустаяСтрока(НовыйПредмет.Наименование) тогда
		ДобавитьХарактеристикиПредмета(НовыйПредмет);	
	//	если экипировка была и её убрали
	ИначеЕсли не ПустаяСтрока(РеквизитПредмет.Наименование) и ПустаяСтрока(НовыйПредмет.Наименование) тогда
		ВычестьХарактеристикиПредмета(РеквизитПредмет);
	// если экипировка была и выбрали другую
	ИначеЕсли не ПустаяСтрока(РеквизитПредмет.Наименование) и не ПустаяСтрока(НовыйПредмет.Наименование) тогда
		ВычестьХарактеристикиПредмета(РеквизитПредмет);
		ДобавитьХарактеристикиПредмета(НовыйПредмет);
	КонецЕсли;  
КонецПроцедуры

#КонецОбласти