#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
&НаСервере
Функция ПолучитьПоследнегоИгрока() Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
		|	Игроки.Ссылка КАК Ссылка,
		|	Игроки.Код КАК Код
		|ИЗ
		|	Справочник.Игроки КАК Игроки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код УБЫВ";
    Результат = Запрос.Выполнить().Выбрать();
    Если Результат.Следующий() Тогда
        Возврат Результат.СправочникСсылка;
    Иначе
        Возврат Неопределено;
    КонецЕсли;
КонецФункции
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти