
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Отбор") и Параметры.Отбор.Свойство("Игрок") тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
			|	РегистрПредметовОстатки.Предмет КАК Предмет,
			|	РегистрПредметовОстатки.КоличествоОстаток КАК Количество
			|ИЗ
			|	РегистрНакопления.РегистрПредметов.Остатки(, Игрок = &Игрок) КАК РегистрПредметовОстатки";
		Запрос.Параметры.Вставить("Игрок",Параметры.Отбор.Игрок);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		РеквезитИнвентарь.Загрузить(РезультатЗапроса);                
	КонецЕсли;
КонецПроцедуры
